<?xml version="1.0" ?>
<net name="ssdlite_mobilenet_v2" version="10">
	<layers>
		<layer id="0" name="2250225415020" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="1" name="2251225515401" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="2252225615056" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="3" name="2253225717069" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="4" name="data_add_178811788656616352" type="Const" version="opset1">
			<data element_type="f16" offset="4" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1870187416136" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1871187516019" type="Const" version="opset1">
			<data element_type="f16" offset="2308" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="1872187615035" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1873187715548" type="Const" version="opset1">
			<data element_type="f16" offset="2308" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="2850285415338" type="Const" version="opset1">
			<data element_type="f16" offset="3460" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="10" name="2851285516409" type="Const" version="opset1">
			<data element_type="f16" offset="3462" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="11" name="2852285615251" type="Const" version="opset1">
			<data element_type="f16" offset="3460" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="12" name="2853285717072" type="Const" version="opset1">
			<data element_type="f16" offset="3462" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="13" name="3070307415575" type="Const" version="opset1">
			<data element_type="f16" offset="3464" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="14" name="3071307515569" type="Const" version="opset1">
			<data element_type="f16" offset="3466" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="15" name="3072307616325" type="Const" version="opset1">
			<data element_type="f16" offset="3464" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="16" name="3073307716778" type="Const" version="opset1">
			<data element_type="f16" offset="3466" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="17" name="3750375417117" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="18" name="3751375515989" type="Const" version="opset1">
			<data element_type="f16" offset="3468" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="19" name="3752375616412" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="20" name="3753375715392" type="Const" version="opset1">
			<data element_type="f16" offset="3468" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/sub/_169__cf__17274815350" type="Const" version="opset1">
			<data element_type="f16" offset="3470" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/sub/_169__cf__172:0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="2530253415515" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="2531253516883" type="Const" version="opset1">
			<data element_type="f16" offset="4622" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="2532253616166" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="2533253716358" type="Const" version="opset1">
			<data element_type="f16" offset="4622" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="3080308416586" type="Const" version="opset1">
			<data element_type="f16" offset="5774" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="27" name="3081308515116" type="Const" version="opset1">
			<data element_type="f16" offset="5776" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="28" name="3082308615629" type="Const" version="opset1">
			<data element_type="f16" offset="5774" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="29" name="3083308716163" type="Const" version="opset1">
			<data element_type="f16" offset="5776" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="30" name="2430243416283" type="Const" version="opset1">
			<data element_type="f16" offset="5778" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="31" name="2431243515176" type="Const" version="opset1">
			<data element_type="f16" offset="5780" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="32" name="2432243615884" type="Const" version="opset1">
			<data element_type="f16" offset="5778" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="33" name="2433243716355" type="Const" version="opset1">
			<data element_type="f16" offset="5780" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="34" name="3290329416871" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="35" name="3291329516286" type="Const" version="opset1">
			<data element_type="f16" offset="5782" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="36" name="3292329615113" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="37" name="3293329717159" type="Const" version="opset1">
			<data element_type="f16" offset="5782" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="38" name="FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/sub/_160__cf__16373315860" type="Const" version="opset1">
			<data element_type="f16" offset="5784" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/sub/_160__cf__163:0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="3810381415938" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="3811381516295" type="Const" version="opset1">
			<data element_type="f16" offset="6936" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="3812381616085" type="Const" version="opset1">
			<data element_type="f16" offset="1156" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="3813381716301" type="Const" version="opset1">
			<data element_type="f16" offset="6936" shape="1,576,1,1" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="2440244416556" type="Const" version="opset1">
			<data element_type="f16" offset="8088" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="44" name="2441244515797" type="Const" version="opset1">
			<data element_type="f16" offset="8090" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="2442244616517" type="Const" version="opset1">
			<data element_type="f16" offset="8088" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="2443244715524" type="Const" version="opset1">
			<data element_type="f16" offset="8090" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="47" name="2630263415272" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="48" name="2631263515260" type="Const" version="opset1">
			<data element_type="f16" offset="8092" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="49" name="2632263616574" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="50" name="2633263715947" type="Const" version="opset1">
			<data element_type="f16" offset="8092" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="51" name="FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/sub/_61__cf__6456816040" type="Const" version="opset1">
			<data element_type="f16" offset="8094" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/sub/_61__cf__64:0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="1970197416298" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="1971197516703" type="Const" version="opset1">
			<data element_type="f16" offset="9630" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="1972197616859" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="1973197717102" type="Const" version="opset1">
			<data element_type="f16" offset="9630" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="3250325415308" type="Const" version="opset1">
			<data element_type="f16" offset="10398" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="57" name="3251325516925" type="Const" version="opset1">
			<data element_type="f16" offset="10400" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="58" name="3252325615077" type="Const" version="opset1">
			<data element_type="f16" offset="10398" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="59" name="3253325715491" type="Const" version="opset1">
			<data element_type="f16" offset="10400" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="60" name="2730273416814" type="Const" version="opset1">
			<data element_type="f16" offset="10402" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="61" name="2731273516139" type="Const" version="opset1">
			<data element_type="f16" offset="10404" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="62" name="2732273616676" type="Const" version="opset1">
			<data element_type="f16" offset="10402" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="63" name="2733273714801" type="Const" version="opset1">
			<data element_type="f16" offset="10404" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="64" name="3190319416130" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="65" name="3191319515146" type="Const" version="opset1">
			<data element_type="f16" offset="10406" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="66" name="3192319616811" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="3193319715533" type="Const" version="opset1">
			<data element_type="f16" offset="10406" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="68" name="FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/sub/_151__cf__15470615830" type="Const" version="opset1">
			<data element_type="f16" offset="10408" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/sub/_151__cf__154:0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="2130213415161" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="2131213517066" type="Const" version="opset1">
			<data element_type="f16" offset="11176" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="2132213617051" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="2133213716877" type="Const" version="opset1">
			<data element_type="f16" offset="11176" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="2740274415932" type="Const" version="opset1">
			<data element_type="f16" offset="11944" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="74" name="2741274516559" type="Const" version="opset1">
			<data element_type="f16" offset="11946" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="75" name="2742274616493" type="Const" version="opset1">
			<data element_type="f16" offset="11944" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="76" name="2743274715485" type="Const" version="opset1">
			<data element_type="f16" offset="11946" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="77" name="3210321416850" type="Const" version="opset1">
			<data element_type="f16" offset="11948" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="78" name="3211321516529" type="Const" version="opset1">
			<data element_type="f16" offset="11950" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="79" name="3212321616448" type="Const" version="opset1">
			<data element_type="f16" offset="11948" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="80" name="3213321716169" type="Const" version="opset1">
			<data element_type="f16" offset="11950" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="81" name="2550255415785" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="82" name="2551255514828" type="Const" version="opset1">
			<data element_type="f16" offset="11952" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="83" name="2552255615110" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="84" name="2553255716886" type="Const" version="opset1">
			<data element_type="f16" offset="11952" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="85" name="FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/sub/_142__cf__14569116538" type="Const" version="opset1">
			<data element_type="f16" offset="11954" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/sub/_142__cf__145:0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="1930193416145" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="1931193516250" type="Const" version="opset1">
			<data element_type="f16" offset="12722" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="1932193616100" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="1933193715497" type="Const" version="opset1">
			<data element_type="f16" offset="12722" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="3220322416304" type="Const" version="opset1">
			<data element_type="f16" offset="13490" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="91" name="3221322514879" type="Const" version="opset1">
			<data element_type="f16" offset="13492" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="92" name="3222322615902" type="Const" version="opset1">
			<data element_type="f16" offset="13490" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="93" name="3223322716514" type="Const" version="opset1">
			<data element_type="f16" offset="13492" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="94" name="3730373415971" type="Const" version="opset1">
			<data element_type="f16" offset="13494" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="95" name="3731373515650" type="Const" version="opset1">
			<data element_type="f16" offset="13496" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="96" name="3732373615518" type="Const" version="opset1">
			<data element_type="f16" offset="13494" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="97" name="3733373716610" type="Const" version="opset1">
			<data element_type="f16" offset="13496" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="98" name="3270327416748" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="99" name="3271327516712" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="100" name="3272327615869" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="101" name="3273327716736" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/sub/_133__cf__13667615119" type="Const" version="opset1">
			<data element_type="f16" offset="13498" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/sub/_133__cf__136:0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="3090309414909" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="3091309516061" type="Const" version="opset1">
			<data element_type="f16" offset="14266" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="3092309614750" type="Const" version="opset1">
			<data element_type="f16" offset="8862" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="3093309714867" type="Const" version="opset1">
			<data element_type="f16" offset="14266" shape="1,384,1,1" size="768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="3740374415776" type="Const" version="opset1">
			<data element_type="f16" offset="15034" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="108" name="3741374517135" type="Const" version="opset1">
			<data element_type="f16" offset="15036" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="109" name="3742374615167" type="Const" version="opset1">
			<data element_type="f16" offset="15034" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="110" name="3743374716499" type="Const" version="opset1">
			<data element_type="f16" offset="15036" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="111" name="1890189417054" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="112" name="1891189516709" type="Const" version="opset1">
			<data element_type="f16" offset="15038" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="113" name="1892189615740" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="114" name="1893189715986" type="Const" version="opset1">
			<data element_type="f16" offset="15038" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/sub/_70__cf__7357015209" type="Const" version="opset1">
			<data element_type="f16" offset="15040" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/sub/_70__cf__73:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="2410241415218" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="2411241516397" type="Const" version="opset1">
			<data element_type="f16" offset="15808" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="2412241616733" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="2413241717156" type="Const" version="opset1">
			<data element_type="f16" offset="15808" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="3610361415326" type="Const" version="opset1">
			<data element_type="f16" offset="16192" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="121" name="3611361514774" type="Const" version="opset1">
			<data element_type="f16" offset="16194" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="122" name="3612361616013" type="Const" version="opset1">
			<data element_type="f16" offset="16192" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="123" name="3613361716640" type="Const" version="opset1">
			<data element_type="f16" offset="16194" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="124" name="2270227415839" type="Const" version="opset1">
			<data element_type="f16" offset="16196" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="125" name="2271227516760" type="Const" version="opset1">
			<data element_type="f16" offset="16198" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="126" name="2272227616151" type="Const" version="opset1">
			<data element_type="f16" offset="16196" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="127" name="2273227715050" type="Const" version="opset1">
			<data element_type="f16" offset="16198" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="128" name="1950195416523" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="129" name="1951195516334" type="Const" version="opset1">
			<data element_type="f16" offset="16200" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="130" name="1952195615287" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="131" name="1953195716253" type="Const" version="opset1">
			<data element_type="f16" offset="16200" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="132" name="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/sub/_124__cf__12764915572" type="Const" version="opset1">
			<data element_type="f16" offset="16202" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/sub/_124__cf__127:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="3550355415935" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="3551355516865" type="Const" version="opset1">
			<data element_type="f16" offset="16586" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="3552355615608" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="3553355716997" type="Const" version="opset1">
			<data element_type="f16" offset="16586" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="2280228415329" type="Const" version="opset1">
			<data element_type="f16" offset="16970" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="138" name="2281228515842" type="Const" version="opset1">
			<data element_type="f16" offset="16972" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="139" name="2282228615536" type="Const" version="opset1">
			<data element_type="f16" offset="16970" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="140" name="2283228716790" type="Const" version="opset1">
			<data element_type="f16" offset="16972" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="141" name="3430343416361" type="Const" version="opset1">
			<data element_type="f16" offset="16974" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="142" name="3431343515041" type="Const" version="opset1">
			<data element_type="f16" offset="16976" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="143" name="3432343615320" type="Const" version="opset1">
			<data element_type="f16" offset="16974" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="144" name="3433343715725" type="Const" version="opset1">
			<data element_type="f16" offset="16976" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="145" name="3470347417033" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="146" name="3471347515206" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="147" name="3472347614930" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="148" name="3473347716553" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="149" name="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/sub/_115__cf__11863416460" type="Const" version="opset1">
			<data element_type="f16" offset="16978" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/sub/_115__cf__118:0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="3370337416379" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="3371337516244" type="Const" version="opset1">
			<data element_type="f16" offset="17362" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="3372337616205" type="Const" version="opset1">
			<data element_type="f16" offset="15424" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="3373337716835" type="Const" version="opset1">
			<data element_type="f16" offset="17362" shape="1,192,1,1" size="384"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="3440344416004" type="Const" version="opset1">
			<data element_type="f16" offset="17746" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="155" name="3441344516367" type="Const" version="opset1">
			<data element_type="f16" offset="17748" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="156" name="3442344615239" type="Const" version="opset1">
			<data element_type="f16" offset="17746" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="157" name="3443344715353" type="Const" version="opset1">
			<data element_type="f16" offset="17748" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="158" name="2750275416445" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="159" name="2751275515896" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="160" name="2752275616439" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="161" name="2753275716688" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="162" name="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/sub/_79__cf__8257214819" type="Const" version="opset1">
			<data element_type="f16" offset="17750" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/sub/_79__cf__82:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="163" name="2830283416229" type="Const" version="opset1">
			<data element_type="f16" offset="18038" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="164" name="2831283516094" type="Const" version="opset1">
			<data element_type="f16" offset="18326" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="165" name="2832283616820" type="Const" version="opset1">
			<data element_type="f16" offset="18038" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="166" name="2833283714852" type="Const" version="opset1">
			<data element_type="f16" offset="18326" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="167" name="1910191416916" type="Const" version="opset1">
			<data element_type="f16" offset="18614" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="168" name="1911191516349" type="Const" version="opset1">
			<data element_type="f16" offset="18616" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="169" name="1912191615230" type="Const" version="opset1">
			<data element_type="f16" offset="18614" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="170" name="1913191716976" type="Const" version="opset1">
			<data element_type="f16" offset="18616" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="171" name="2170217415803" type="Const" version="opset1">
			<data element_type="f16" offset="18618" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="172" name="2171217515014" type="Const" version="opset1">
			<data element_type="f16" offset="18620" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="173" name="2172217616724" type="Const" version="opset1">
			<data element_type="f16" offset="18618" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="174" name="2173217715848" type="Const" version="opset1">
			<data element_type="f16" offset="18620" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="175" name="3390339417141" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="176" name="3391339516121" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="177" name="3392339614951" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="178" name="3393339715638" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="179" name="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/sub/_106__cf__10960716157" type="Const" version="opset1">
			<data element_type="f16" offset="18622" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/sub/_106__cf__109:0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="180" name="2050205415236" type="Const" version="opset1">
			<data element_type="f16" offset="18038" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="181" name="2051205516991" type="Const" version="opset1">
			<data element_type="f16" offset="18910" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="182" name="2052205615365" type="Const" version="opset1">
			<data element_type="f16" offset="18038" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="183" name="2053205715722" type="Const" version="opset1">
			<data element_type="f16" offset="18910" shape="1,144,1,1" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="184" name="2180218416373" type="Const" version="opset1">
			<data element_type="f16" offset="19198" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="185" name="2181218517138" type="Const" version="opset1">
			<data element_type="f16" offset="19200" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="186" name="2182218615185" type="Const" version="opset1">
			<data element_type="f16" offset="19198" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="187" name="2183218716505" type="Const" version="opset1">
			<data element_type="f16" offset="19200" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="188" name="2890289415950" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="189" name="2891289516589" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="190" name="2892289616772" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="191" name="2893289715299" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="192" name="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/sub/_88__cf__9157415476" type="Const" version="opset1">
			<data element_type="f16" offset="19202" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" names="FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/sub/_88__cf__91:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="193" name="3010301415872" type="Const" version="opset1">
			<data element_type="f16" offset="19394" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="194" name="3011301517057" type="Const" version="opset1">
			<data element_type="f16" offset="19586" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="195" name="3012301616847" type="Const" version="opset1">
			<data element_type="f16" offset="19394" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="196" name="3013301716667" type="Const" version="opset1">
			<data element_type="f16" offset="19586" shape="1,96,1,1" size="192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="197" name="2910291415464" type="Const" version="opset1">
			<data element_type="f16" offset="19778" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="198" name="2911291516535" type="Const" version="opset1">
			<data element_type="f16" offset="19780" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="199" name="2912291616805" type="Const" version="opset1">
			<data element_type="f16" offset="19778" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="200" name="2913291717111" type="Const" version="opset1">
			<data element_type="f16" offset="19780" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="201" name="3670367416634" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="202" name="3671367516115" type="Const" version="opset1">
			<data element_type="f16" offset="2" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="203" name="3672367616979" type="Const" version="opset1">
