<?xml version="1.0" ?>
<net name="efficientnet-b0" version="10">
	<layers>
		<layer id="0" name="3586359012821" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="3587359112182" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="3588359212677" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="3589359312869" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="efficientnet-b0/model/head/global_average_pooling2d/MeanGather143641867491013802" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="2556256013943" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="2557256113403" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="2558256212929" type="Const" version="opset1">
			<data element_type="f32" offset="24" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="2559256314000" type="Const" version="opset1">
			<data element_type="f32" offset="28" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="9" name="2306231011222" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="10" name="2307231112797" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="11" name="2308231211846" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="2309231311432" type="Const" version="opset1">
			<data element_type="f32" offset="36" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="2396240013301" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="14" name="2397240112617" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="2398240212317" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="2399240312266" type="Const" version="opset1">
			<data element_type="f32" offset="44" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="2476248011990" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="2477248111360" type="Const" version="opset1">
			<data element_type="f32" offset="52" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="2478248212755" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="2479248311816" type="Const" version="opset1">
			<data element_type="f32" offset="52" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="2646265012647" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="2647265113982" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="2648265214078" type="Const" version="opset1">
			<data element_type="f32" offset="56" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="2649265313856" type="Const" version="opset1">
			<data element_type="f32" offset="60" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="2706271014018" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="2707271113655" type="Const" version="opset1">
			<data element_type="f32" offset="68" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="2708271213433" type="Const" version="opset1">
			<data element_type="f32" offset="64" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="2709271311267" type="Const" version="opset1">
			<data element_type="f32" offset="68" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="128681906788813934" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="2906291013016" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="31" name="2907291112215" type="Const" version="opset1">
			<data element_type="f32" offset="76" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="2908291213103" type="Const" version="opset1">
			<data element_type="f32" offset="72" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="2909291311918" type="Const" version="opset1">
			<data element_type="f32" offset="76" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="2116212013175" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="2117212113499" type="Const" version="opset1">
			<data element_type="f32" offset="4688" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="2118212213205" type="Const" version="opset1">
			<data element_type="f32" offset="80" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="2119212313157" type="Const" version="opset1">
			<data element_type="f32" offset="4688" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="3356336012962" type="Const" version="opset1">
			<data element_type="f32" offset="9296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="3357336111639" type="Const" version="opset1">
			<data element_type="f32" offset="9300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="3358336211780" type="Const" version="opset1">
			<data element_type="f32" offset="9296" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="3359336313907" type="Const" version="opset1">
			<data element_type="f32" offset="9300" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="2566257011660" type="Const" version="opset1">
			<data element_type="f32" offset="9304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="2567257113865" type="Const" version="opset1">
			<data element_type="f32" offset="9308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="2568257212119" type="Const" version="opset1">
			<data element_type="f32" offset="9304" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="45" name="2569257312857" type="Const" version="opset1">
			<data element_type="f32" offset="9308" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="46" name="2456246011681" type="Const" version="opset1">
			<data element_type="f32" offset="9312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="47" name="2457246112395" type="Const" version="opset1">
			<data element_type="f32" offset="9316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="48" name="2458246213409" type="Const" version="opset1">
			<data element_type="f32" offset="9312" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="49" name="2459246312068" type="Const" version="opset1">
			<data element_type="f32" offset="9316" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="50" name="3466347013961" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="3467347113742" type="Const" version="opset1">
			<data element_type="f32" offset="9320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="3468347213442" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="3469347311648" type="Const" version="opset1">
			<data element_type="f32" offset="9320" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="1756176012752" type="Const" version="opset1">
			<data element_type="f32" offset="9324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="1757176113940" type="Const" version="opset1">
			<data element_type="f32" offset="9328" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="1758176213964" type="Const" version="opset1">
			<data element_type="f32" offset="9324" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="1759176312794" type="Const" version="opset1">
			<data element_type="f32" offset="9328" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="3726373012995" type="Const" version="opset1">
			<data element_type="f32" offset="9332" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="3727373111393" type="Const" version="opset1">
			<data element_type="f32" offset="9336" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="3728373212482" type="Const" version="opset1">
			<data element_type="f32" offset="9332" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="3729373312650" type="Const" version="opset1">
			<data element_type="f32" offset="9336" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="128421878886012248" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="3656366011525" type="Const" version="opset1">
			<data element_type="f32" offset="9340" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="64" name="3657366113757" type="Const" version="opset1">
			<data element_type="f32" offset="9344" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="65" name="3658366213034" type="Const" version="opset1">
			<data element_type="f32" offset="9340" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="3659366313406" type="Const" version="opset1">
			<data element_type="f32" offset="9344" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="1896190013322" type="Const" version="opset1">
			<data element_type="f32" offset="9348" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1897190112578" type="Const" version="opset1">
			<data element_type="f32" offset="13956" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1898190212509" type="Const" version="opset1">
			<data element_type="f32" offset="9348" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="1899190312179" type="Const" version="opset1">
			<data element_type="f32" offset="13956" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="3456346013352" type="Const" version="opset1">
			<data element_type="f32" offset="18564" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="3457346111999" type="Const" version="opset1">
			<data element_type="f32" offset="23172" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="3458346213565" type="Const" version="opset1">
			<data element_type="f32" offset="18564" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="3459346313862" type="Const" version="opset1">
			<data element_type="f32" offset="23172" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="efficientnet-b0/model/blocks_14/tpu_batch_normalization/batchnorm/mul_1_copy85011714" type="Const" version="opset1">
			<data element_type="f32" offset="27780" shape="1152,192,1,1" size="884736"/>
			<output>
				<port id="0" names="efficientnet-b0/blocks_14/conv2d/kernel/read:0" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="efficientnet-b0/model/blocks_14/conv2d/Conv2D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="2576258011993" type="Const" version="opset1">
			<data element_type="f32" offset="912516" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="2577258112827" type="Const" version="opset1">
			<data element_type="f32" offset="912520" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="2578258211543" type="Const" version="opset1">
			<data element_type="f32" offset="912516" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="2579258312662" type="Const" version="opset1">
			<data element_type="f32" offset="912520" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="2866287013379" type="Const" version="opset1">
			<data element_type="f32" offset="912524" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="2867287111747" type="Const" version="opset1">
			<data element_type="f32" offset="912528" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="83" name="2868287213055" type="Const" version="opset1">
			<data element_type="f32" offset="912524" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="84" name="2869287313010" type="Const" version="opset1">
			<data element_type="f32" offset="912528" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="85" name="1996200011915" type="Const" version="opset1">
			<data element_type="f32" offset="912532" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="86" name="1997200113376" type="Const" version="opset1">
			<data element_type="f32" offset="912536" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="1998200213142" type="Const" version="opset1">
			<data element_type="f32" offset="912532" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="1999200311363" type="Const" version="opset1">
			<data element_type="f32" offset="912536" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="2976298011156" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="2977298113781" type="Const" version="opset1">
			<data element_type="f32" offset="912540" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="2978298212431" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="2979298313151" type="Const" version="opset1">
			<data element_type="f32" offset="912540" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="2416242013607" type="Const" version="opset1">
			<data element_type="f32" offset="912544" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="2417242112170" type="Const" version="opset1">
			<data element_type="f32" offset="912548" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="95" name="2418242211225" type="Const" version="opset1">
			<data element_type="f32" offset="912544" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="96" name="2419242311642" type="Const" version="opset1">
			<data element_type="f32" offset="912548" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="97" name="1846185012758" type="Const" version="opset1">
			<data element_type="f32" offset="912552" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="98" name="1847185111813" type="Const" version="opset1">
			<data element_type="f32" offset="912556" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="99" name="1848185212191" type="Const" version="opset1">
			<data element_type="f32" offset="912552" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="100" name="1849185311924" type="Const" version="opset1">
			<data element_type="f32" offset="912556" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="128161856683212245" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="3196320012851" type="Const" version="opset1">
			<data element_type="f32" offset="912560" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="3197320114171" type="Const" version="opset1">
			<data element_type="f32" offset="912564" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="3198320214108" type="Const" version="opset1">
			<data element_type="f32" offset="912560" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="3199320311705" type="Const" version="opset1">
			<data element_type="f32" offset="912564" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="1656166011240" type="Const" version="opset1">
			<data element_type="f32" offset="912568" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="1657166113817" type="Const" version="opset1">
			<data element_type="f32" offset="917176" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="1658166213286" type="Const" version="opset1">
			<data element_type="f32" offset="912568" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="1659166311759" type="Const" version="opset1">
			<data element_type="f32" offset="917176" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="3716372013337" type="Const" version="opset1">
			<data element_type="f32" offset="921784" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="3717372114126" type="Const" version="opset1">
			<data element_type="f32" offset="926392" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="3718372211726" type="Const" version="opset1">
			<data element_type="f32" offset="921784" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="3719372313052" type="Const" version="opset1">
			<data element_type="f32" offset="926392" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="efficientnet-b0/model/blocks_13/tpu_batch_normalization/batchnorm/mul_1_copy82214027" type="Const" version="opset1">
			<data element_type="f32" offset="931000" shape="1152,192,1,1" size="884736"/>
			<output>
				<port id="0" names="efficientnet-b0/blocks_13/conv2d/kernel/read:0" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="efficientnet-b0/model/blocks_13/conv2d/Conv2D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="2876288012506" type="Const" version="opset1">
			<data element_type="f32" offset="1815736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="2877288111630" type="Const" version="opset1">
			<data element_type="f32" offset="1815740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="2878288213583" type="Const" version="opset1">
			<data element_type="f32" offset="1815736" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="2879288313715" type="Const" version="opset1">
			<data element_type="f32" offset="1815740" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="2516252013730" type="Const" version="opset1">
			<data element_type="f32" offset="1815744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="2517252113070" type="Const" version="opset1">
			<data element_type="f32" offset="1815748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="2518252213484" type="Const" version="opset1">
			<data element_type="f32" offset="1815744" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="123" name="2519252314135" type="Const" version="opset1">
			<data element_type="f32" offset="1815748" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="124" name="3076308011495" type="Const" version="opset1">
			<data element_type="f32" offset="1815752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="125" name="3077308112917" type="Const" version="opset1">
			<data element_type="f32" offset="1815756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="3078308212629" type="Const" version="opset1">
			<data element_type="f32" offset="1815752" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="3079308311783" type="Const" version="opset1">
			<data element_type="f32" offset="1815756" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="2886289013841" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="2887289113568" type="Const" version="opset1">
			<data element_type="f32" offset="1815760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="2888289211618" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="2889289312017" type="Const" version="opset1">
			<data element_type="f32" offset="1815760" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="2756276014180" type="Const" version="opset1">
			<data element_type="f32" offset="1815764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="2757276111237" type="Const" version="opset1">
			<data element_type="f32" offset="1815768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="2758276211291" type="Const" version="opset1">
			<data element_type="f32" offset="1815764" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="2759276313610" type="Const" version="opset1">
			<data element_type="f32" offset="1815768" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="2796280012665" type="Const" version="opset1">
			<data element_type="f32" offset="1815772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="137" name="2797280113973" type="Const" version="opset1">
			<data element_type="f32" offset="1815776" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="138" name="2798280211339" type="Const" version="opset1">
			<data element_type="f32" offset="1815772" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="139" name="2799280313439" type="Const" version="opset1">
			<data element_type="f32" offset="1815776" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="140" name="127901869280411381" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="3306331011678" type="Const" version="opset1">
			<data element_type="f32" offset="1815780" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="142" name="3307331111186" type="Const" version="opset1">
			<data element_type="f32" offset="1815784" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="143" name="3308331213298" type="Const" version="opset1">
			<data element_type="f32" offset="1815780" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="3309331313478" type="Const" version="opset1">
			<data element_type="f32" offset="1815784" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="2916292011351" type="Const" version="opset1">
			<data element_type="f32" offset="1815788" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="2917292112683" type="Const" version="opset1">
			<data element_type="f32" offset="1820396" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="147" name="2918292211180" type="Const" version="opset1">
			<data element_type="f32" offset="1815788" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="2919292313130" type="Const" version="opset1">
			<data element_type="f32" offset="1820396" shape="1,1152,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="3436344013412" type="Const" version="opset1">
			<data element_type="f32" offset="1825004" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="3437344111882" type="Const" version="opset1">
			<data element_type="f32" offset="1829612" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="3438344213148" type="Const" version="opset1">
			<data element_type="f32" offset="1825004" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="3439344312743" type="Const" version="opset1">
			<data element_type="f32" offset="1829612" shape="1152,1,1,1" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="efficientnet-b0/model/blocks_12/tpu_batch_normalization/batchnorm/mul_1_copy79411564" type="Const" version="opset1">
			<data element_type="f32" offset="1834220" shape="1152,192,1,1" size="884736"/>
			<output>
				<port id="0" names="efficientnet-b0/blocks_12/conv2d/kernel/read:0" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="154" name="efficientnet-b0/model/blocks_12/conv2d/Conv2D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>1152</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1152</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="155" name="2526253012041" type="Const" version="opset1">
			<data element_type="f32" offset="2718956" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="156" name="2527253112707" type="Const" version="opset1">
			<data element_type="f32" offset="2718960" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="157" name="2528253212569" type="Const" version="opset1">
			<data element_type="f32" offset="2718956" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="158" name="2529253311510" type="Const" version="opset1">
			<data element_type="f32" offset="2718960" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="159" name="2846285012251" type="Const" version="opset1">
			<data element_type="f32" offset="2718964" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="160" name="2847285112254" type="Const" version="opset1">
			<data element_type="f32" offset="2718968" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="161" name="2848285213685" type="Const" version="opset1">
			<data element_type="f32" offset="2718964" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="162" name="2849285313094" type="Const" version="opset1">
			<data element_type="f32" offset="2718968" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="163" name="3246325013370" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="164" name="3247325112059" type="Const" version="opset1">
			<data element_type="f32" offset="2718972" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="165" name="3248325212434" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="166" name="3249325312203" type="Const" version="opset1">
			<data element_type="f32" offset="2718972" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="167" name="1576158012239" type="Const" version="opset1">
			<data element_type="f32" offset="2718976" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="168" name="1577158113028" type="Const" version="opset1">
			<data element_type="f32" offset="2718980" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="169" name="1578158212947" type="Const" version="opset1">
			<data element_type="f32" offset="2718976" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="170" name="1579158312401" type="Const" version="opset1">
			<data element_type="f32" offset="2718980" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="171" name="3286329013775" type="Const" version="opset1">
			<data element_type="f32" offset="2718984" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="172" name="3287329114039" type="Const" version="opset1">
			<data element_type="f32" offset="2718988" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="173" name="3288329213001" type="Const" version="opset1">
			<data element_type="f32" offset="2718984" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="174" name="3289329311699" type="Const" version="opset1">
			<data element_type="f32" offset="2718988" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="175" name="127641906477713193" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="176" name="2816282012176" type="Const" version="opset1">
			<data element_type="f32" offset="2718992" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="177" name="2817282113127" type="Const" version="opset1">
			<data element_type="f32" offset="2718996" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="178" name="2818282211582" type="Const" version="opset1">
			<data element_type="f32" offset="2718992" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="179" name="2819282311951" type="Const" version="opset1">
			<data element_type="f32" offset="2718996" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="180" name="3156316013505" type="Const" version="opset1">
			<data element_type="f32" offset="2719000" shape="1,672,1,1" size="2688"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="181" name="3157316111513" type="Const" version="opset1">
			<data element_type="f32" offset="2721688" shape="1,672,1,1" size="2688"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="182" name="3158316213190" type="Const" version="opset1">
			<data element_type="f32" offset="2719000" shape="1,672,1,1" size="2688"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="183" name="3159316312956" type="Const" version="opset1">
			<data element_type="f32" offset="2721688" shape="1,672,1,1" size="2688"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>672</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="184" name="1506151011930" type="Const" version="opset1">
			<data element_type="f32" offset="2724376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="185" name="1507151112890" type="Const" version="opset1">
			<data element_type="f32" offset="2724380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="186" name="1508151211189" type="Const" version="opset1">
			<data element_type="f32" offset="2724376" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="187" name="1509151313427" type="Const" version="opset1">
			<data element_type="f32" offset="2724380" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="188" name="3566357014129" type="Const" version="opset1">
			<data element_type="f32" offset="2724384" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="189" name="3567357111840" type="Const" version="opset1">
			<data element_type="f32" offset="2724388" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="190" name="3568357213181" type="Const" version="opset1">
			<data element_type="f32" offset="2724384" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="191" name="3569357311774" type="Const" version="opset1">
			<data element_type="f32" offset="2724388" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="192" name="2096210012845" type="Const" version="opset1">
			<data element_type="f32" offset="2724392" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="193" name="2097210113112" type="Const" version="opset1">
			<data element_type="f32" offset="2724396" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="194" name="2098210211141" type="Const" version="opset1">
			<data element_type="f32" offset="2724392" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="195" name="2099210312374" type="Const" version="opset1">
			<data element_type="f32" offset="2724396" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="196" name="2226223011489" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="197" name="2227223112761" type="Const" version="opset1">
			<data element_type="f32" offset="2724400" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="198" name="2228223212659" type="Const" version="opset1">
			<data element_type="f32" offset="48" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="199" name="2229223313358" type="Const" version="opset1">
			<data element_type="f32" offset="2724400" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="200" name="2246225013361" type="Const" version="opset1">
			<data element_type="f32" offset="2724404" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="201" name="2247225113580" type="Const" version="opset1">
			<data element_type="f32" offset="2724408" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="202" name="2248225211303" type="Const" version="opset1">
			<data element_type="f32" offset="2724404" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="203" name="2249225313874" type="Const" version="opset1">
			<data element_type="f32" offset="2724408" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="204" name="1736174011723" type="Const" version="opset1">
			<data element_type="f32" offset="2724412" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="205" name="1737174111822" type="Const" version="opset1">
			<data element_type="f32" offset="2724416" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="206" name="1738174211795" type="Const" version="opset1">
			<data element_type="f32" offset="2724412" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="207" name="1739174311594" type="Const" version="opset1">
			<data element_type="f32" offset="2724416" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="208" name="127381891174911414" type="Const" version="opset1">
			<data element_type="i64" offset="8" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="209" name="3766377013724" type="Const" version="opset1">
			<data element_type="f32" offset="2724420" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="210" name="3767377113850" type="Const" version="opset1">
			<data element_type="f32" offset="2724424" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="211" name="3768377213694" type="Const" version="opset1">
			<data element_type="f32" offset="2724420" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="212" name="3769377311981" type="Const" version="opset1">
			<data element_type="f32" offset="2724424" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="213" name="1826183013634" type="Const" version="opset1">
			<data element_type="f32" offset="2724428" shape="1,672,1,1" size="2688"/>
			<output>
